<template>
    <Doc>
        <H1>my-reoute-history</H1>
        <P>my-reoute-history是<Strong>my-reoute</Strong>的一个子项目，旨在用于浏览器上实现高仿APP式的单页面路由。my-reoute-history屏蔽了浏览器的诸多行为，如：记录用户历史记录、前进按钮等，并可以监听用户返回动作，使得WebApp路由变得更像App。可用于PWA路由开发、WebApp路由开发、微信小程序路由浏览器实现等场景。</P>
        
        <H2>解决的问题</H2>
        <P>在web路由中，经常会将app路由的状态保存到浏览器的URL中，把用户的浏览器记录保存到浏览器的浏览器记录中。这是因为在浏览器中，用户可以刷新页面，一旦刷新页面后如果不在原来的页面上，会让用户感觉非常奇怪。同时，浏览器的地址栏上面有前进、后退按钮，用户习惯使用这些按钮进行页面导航。</P>
        <P>然而将App的访问记录和浏览器的访问记录一对一的相对后，会产生一些问题。如：无法修改和删除已经浏览记录、无法查询用户的浏览器记录、无法监听返回事件、用户可以通过<Strong>地址栏的前进按钮</Strong>访问已经离开的页面。这些都给App开发造成了麻烦。</P>
        
        <H3>无法监听返回事件</H3>
        <P>安卓浏览器提供了系统的返回按钮，这刚和浏览器的<Srong>退回按钮</Srong>相对应，不过与安卓的返回按钮不同的事，我们无法监听浏览器的<Srong>退回按钮</Srong>的点击以及阻止默认的事件响应。例如我们在页面中打开一个对话框，单用户点击返回按钮时，其实是希望关闭这个对话框（如极大多数安卓APP那样），而实际表现却是返回上一个页面，这样不符合用户的操作习惯。</P>

        <H3>无法修改、删除已经浏览记录</H3>
        <P>用户在进行一个事务操作时候，往往会访问多个页面。如一个表单分为多个页面录入，最后一个页面提交表单，提交后这些页面都应该从历史记录中删除，以免用户退回表单页面，并重复提交表单。而浏览器的访问记录，是无法删除的。</P>

        <H3>无法查询用户的浏览器记录</H3>
        <P>有些场景我们想要获取用户在WebApp内部的访问历史记录，可是history是禁止用户查询的。当然我们可以自己通过路由钩子收集访问记录信息到内存中，但是用户一刷新浏览器内存的历史记录也会跟着消失。</P>

        <P><Strong>my-router-history</Strong>就是为了填补这样的空白，能够我们构建路由不再受限于浏览器地址栏的限制。要解决这个问题，就让要App的浏览记录和浏览器地址栏的浏览器记录分离出来，但是仍然将页面的信息保存到URL上，并对浏览器的地址栏做监听，实现对返回按钮的监听。而目前的路由主要是两种，基于内存的和浏览器URL无关的路由系统，以及基于浏览器地址栏的，受限于浏览器地址栏的路由。他们要不无法做到浏览器地址栏和页面的访问记录的联动，要不无法将浏览器地址栏的访问记录和App的访问记录分离，这导致了我们很难做出高品质的应用。</P>

        <H2>安装</H2>
        <P>暂未开放npm安装</P>
    </Doc>
</template>
