<template>
    <Doc>
        <H1>my-reoute-history</H1>
        <P>my-reoute-history是my-reoute 的一个子项目，旨在用于浏览器上实现高仿APP式的单页面路由。my-reoute-history屏蔽了浏览器的诸多行为：记录用户历史记录、前进按钮等，并监听用户返回动作，使得WebApp路由变得更像App。可用于PWA路由开发、WebApp路由开发、微信小程序路由移植等场景。</P>
        
        <H2>解决的问题</H2>
        <P>在web路由中，经常会将app路由的状态保存到浏览器的URL中。这是因为在浏览器中，用户可以刷新页面，一旦刷新页面后如果不在原来的页面上，会让用户感觉非常奇怪。浏览器的地址栏上面有前进、后退按钮，用户习惯使用这些按钮进行页面导航。而将页面状态保存到URL上面，在用户刷新页面后，URL是不变的，这样可以让用户留在刷新时候的页面中，同时用户可以使用浏览器的地址栏的按钮实现页面导航。</P>
        <P>当然我们将用户的路由信息绑定到浏览器history，代价也是有的。最主要的问题就是我们无法阻止用户点击返回按钮，例如我们在页面中打开一个对话框，单用户点击返回按钮时，其实是希望关闭这个对话框（如极大多数安卓APP），而在浏览器中却是返回上一个页面。</P>
    </Doc>
</template>
